#+options: ':nil *:t -:t ::t <:t H:3 \n:nil ^:nil arch:headline author:t broken-links:nil
#+options: c:nil creator:nil d:(not "LOGBOOK") date:t e:t email:nil f:t inline:t num:t
#+options: p:nil pri:nil prop:t stat:t tags:t tasks:t tex:t timestamp:t title:t toc:nil
#+options: todo:t |:t
#+title: SPARQL Playground in Emacs OR Worst Notebook Ever
#+date: <2022-06-10 Fri>
#+author: Gregory Grubbs
#+email: gregory.grubbs@gmail.com
#+language: en
#+select_tags: export
#+exclude_tags: noexport
#+creator: Emacs 28.1.50 (Org mode 9.5.3)
#+setupfile: ~/projects/emacs/org-html-themes/org/theme-readtheorg-local.setup
#+startup: overview
** Emacs table lookup stuff

    #+TBLNAME: rates
   | currency        | abbreviation | euros |
   |-----------------+--------------+-------|
   | euro            | eur          |     1 |
   | Norwegian krone | nok          |  0.15 |
   | Swedish krona   | sek          |  0.12 |
   | US dollar       | usd          |  0.77 |

   |  date | expense          |  sum | currency | rate |   euros |
   |-------+------------------+------+----------+------+---------|
   |  1.3. | flights          |  324 | eur      |    1 |     324 |
   |  4.6. | books and maps   |  243 | usd      | 0.77 |  187.11 |
   | 30.7. | rental car       | 8300 | sek      | 0.12 |    996. |
   |  2.7. | hotel            | 1150 | sek      | 0.12 |    138. |
   |  2.7. | lunch            |  190 | sek      | 0.12 |    22.8 |
   |  3.7. | fishing licenses | 1400 | nok      | 0.15 |    210. |
   |  3.7. | gasoline         |  340 |          |  nil | 340 nil |
   #+TBLFM: $5='(org-lookup-first $4 '(remote(rates,@2$2..@>$2)) '(remote(rates,@2$3..@>$3)))::$6=$5*$3
